STMicroelectronics/STM32CubeU3/Projects/STM32U366E-DK/Templates/Inc/stm32u366e_discovery_conf.h
/**
  ******************************************************************************
  * @file    stm32u366e_discovery_conf_template.h
  * @author  MCD Application Team
  * @brief   STM32U366E-DK board configuration file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U366E_DK_CONF_H
#define STM32U366E_DK_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32U366E_DK
  * @{
  */

/** @defgroup STM32U366E_DK_CONFIG Config
  * @{
  */

/** @defgroup STM32U366E_DK_CONFIG_Exported_Constants Exported Constants
  * @{
  */

/* JOY define */
#define USE_BSP_JOY_FEATURE                 1U

/* Environmental Sensors usage */
#define USE_ENV_SENSOR_STTS22H_0          1U

/* COM port usage */
#if defined(USE_VCP_CONNECTION)
#define USE_BSP_COM_FEATURE                  1U
#define USE_COM_LOG                          1U
#else
#define USE_BSP_COM_FEATURE                  0U
#define USE_COM_LOG                          0U
#endif /* USE_VCP_CONNECTION */

/* JOY define */
#define USE_BSP_JOY_FEATURE                 1U

/* IRQ priorities */
#define BSP_BUTTON_USER_IT_PRIORITY          15U

/* I2C1 Frequency in Hz  */
#define BUS_I2C1_FREQUENCY                   100000UL /* Frequency of I2C1 = 100 KHz*/

#define STM32U366E_DK_I2C_Init BSP_I2C1_Init
#define STM32U366E_DK_I2C_DeInit BSP_I2C1_DeInit
#define STM32U366E_DK_I2C_ReadReg BSP_I2C1_ReadReg
#define STM32U366E_DK_I2C_WriteReg BSP_I2C1_WriteReg
#define STM32U366E_DK_I2C_ReadData BSP_I2C1_ReadData
#define STM32U366E_DK_I2C_WriteData BSP_I2C1_WriteData

#define STM32U366E_DK_GetTick BSP_GetTick

/* ENV_SENSOR define */
#define USE_ENV_SENSOR_STTS22H_0       1U


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U366E_DK_CONF_H */
